package Stage2;


public class CellphoneProviso extends ChoiceObject2 {
	{
		this.choicename ="휴대폰";
		this.choiceObjectLines = new String[] {
				"평범한 갤럭시 휴대폰이다.",
				"오래 된 모델인데다가 액정의 오른쪽 귀퉁이에 금이 가 있다. 하지만 여전히 문제없이 작동한다",
				"위이잉",
				"휴대폰을 집어 올리다가 화면이 눌렸는지 옅은 진동이 느껴졌다.",
				"삑, 삑 하는 기계음이 멀리서 들리더니, 바퀴 끌리는 소리를 내며 작은 장난감이 확 튀어나왔다.",
				"\"이건.....\"",
				"아래쪽에 바퀴가 달린, 작은 쥐 모양의 장난감이 구석에서 튀어나왔다 ",
				"조사 대상에 \'원격 조종 장난감\'이 추가되었습니다."
		};
		this.CombchoiceObjectLines =new String[]
						{
						"휴대폰에는 기본적으로 개인정보가 있는게 정상이겠지?",
						"생각이 미치자 얼른 휴대폰을 집어들었다.",
						"\"뭐야...? 이거 왜 이래..?\"",
						"아까까지만 해도 잘 작동했던 휴대폰은 갑자기 먹통이라도 된 듯 아무리 눌러도 반응이 없다.",
						"\"진짜 사람 환장하게 만드는구만....\""
						};
	}

}
