package Stage2;

public class Stage2Lines extends Stage2Flow {
	public String[] orgbase = 
		{	"=============================================================================",
			"==================================생각 정리====================================",
			"============================================================================="	
		};
	public String[] stage2Start=
		{		"문을 열고 안으로 들어가자, 눅눅하고 후텁지근한 공기가 훅 몰아쳤다",
				"좁은 거실에 옹기종기 모여있는 가구들, 이상할 정도로 큰 냉장고와 푹신해 보이는 소파",
				"익숙하지만... 어딘가 낯설게 느껴지는 풍경이다.",
				"\"쿵!\"",
				"어깨를 묘하게 짓누르던 에코백을 바닥에 던지고, 한숨을 쉬며 신발을 벗었다.",
				"\"하아아아아아아아...\"",
				"오늘은 너무 많은 일이 있었다.. 정말로...",
				"집에 오자마자 도어락이 고장나질 않나.. 정말 되는 일이 하나도 없다.",
				"\"그래도 돌아왔으니까..\"",
				"그런데...",
				"\"도대체 뭐야...\"",
				"아까부터 느껴지는 이 기묘한 위화감과...",
				"뭔가 잊어버린 것 같은 이 찜찜한 느낌...",
				"\"내가....뭔가를 놓치고 있는 걸까..?\"",
				"피로가 뇌를 지배해서 당장이라도 누워서 잠들고 싶지만",
				"이 찜찜한 느낌이 도저히 떨쳐지질 않고, 머릿속을 완전히 뒤흔들고 있다.",
				"내가 도대체 뭐를 잊어버린거지..?",
				"...\r\n"
		};
	public String[] stage2Ecobag =
		{
				"바닥에 집어던진 에코백에 눈이 향했다.",
				"저 안에 내가 잊어버린 무언가에 대한 단서가 있을지도 몰라.",
				"아무렇게나 널부러져 있는 에코백을 집어들었다.",
				"에코백을 거꾸로 뒤집자 요란한 소리를 내며 내용물들이 우수수 쏟아졌다.",
				"이건 아니고.... 이건 또 뭐야... 이런 건 전혀 쓸모없잖아..",
				"전혀 쓸모없어 보이는 것들을 제외하니, 지갑과 휴대폰 그리고 뭐가 들어있는지 알 수 없는 작은 봉투가 남았다.",
				"...\r\n"
		};
	public String[] stage2Organize =
		{
				"이런 장난감이 왜...",
				"이런 류의 장난감은 보통 고양이를 키우는 집에나 있는 장난감인데..",
				"\"나...고양이를 키웠었나...?\"",
				"장난감을 보기 전까지 고양이를 키웠다는 사실조차 잊고 있었다니..",
				"깨닫고 보니 아까부터 부옇게 안개가 낀 것처럼 머릿속이 흐릿한 느낌이다.",
				"\"내...내 이름이 뭐였지.....?\"",
				"스스로 뱉으면서도 어이가 없는 말에 헛웃음이 잠깐 나올 뻔 했지만, 상기하면서도 도저히 내 이름이 기억나질 않는다.",
				"\"나는...누구고...뭐 하는 사람이었지....?\" ",
				"도저히 기억해 낼 수가 없다.",
				"....\r\n"
		};
	public String[] stage2CombinationLines =
		{
				"아까부터 이상하게 들던 위화감이 이것 때문이었나..",
				"스스로의 이름도 기억해내지 못한다니...",
				"혹시 지금까지 조사해본 물건들 중에 내 정체를 기억해낼 만한 것들이 있을까?",
				"지금까지 조사해 본 것들 중에 몇 가지는 있었던 것 같은데..",
				"\"떠올려보자.... 나를 기억해낼 만한 것들을....\"",
				"...\r\n"
		};
	public String[] stage2identityLines =
		{
				"지갑에서 나온 신분증을 읽어보았다.",
				"\"내 이름은 한수연... 26세..\"",
				"신분증에 적혀있는 내 신상정보를 따라 읽어보았지만,",
				"마치 전혀 무관한, 처음 보는 사람의 신상을 읽는 것 처럼 아무런 느낌도 들지 않는다.",
				"\"나... 단기 기억 상실증이라도 걸린 건가...?\"",
				"장난감을 보고 고양이를 떠올렸을 때처럼",
				"번쩍 하고 무언가가 떠오르길 기대했지만,",
				"다시 신분증을 따라 읽어보아도 그 이름은 그저 공허하게 맴돌다가 사라질 뿐이었다.",
				"\"내 이름은 한수연.. 내 이름은 한수연.... 26세.. 고양이 마루를 키운다...\"",
				"일단은 잊지 않게 잘 기억해두자. 그리고...",
				"\"고양이...그래.. 우리 마루는 어디에 있지..?\"",
				"일단 마루를 찾으면 뭐라도 더 기억나지 않을까 하는 생각에",
				"급히 거실을 가로질러 안방으로 향했다.",
				"안방 문 앞에 다다르자,",
				"\" 닫혀있네...\"",
				"오늘따라 유독 닫힌 문을 많이 보는 것 같다....",
				"\'[결정적인 단서] : 정체성\'을 획득하셨습니다",
				"...\r\n"
		};
	public String[] stage2DoorHandleLines =
		{
				"조심스럽게 문 손잡이에 손을 가져다 대었다",
				"도대체 무슨 일인지 정황조차 모르겠고, 정신도 하나도 없지만",
				"일단 안방으로 들어가 보자.",
				"덜컥 덜컥",
				"옅게 한숨을 쉬었다",
				"\"역시나...\"",
				"문은 굳게 잠겨있었다.",
				"...\r\n"
		};
	public String[] stage2DoorKnockLines =
		{
				"오른 손으로 주먹을 쥐고 문을 세게 두드렸다",
				"쾅! 쾅! 쾅! 쾅!",
				"콰직!! 쿵!!!",
				"문이 힘없이 부서지며 뒤로 넘어갔다",
				"\"뭐...뭐야?\"",
				"아무리 그래도 나무로 된 방문인데.. 이렇게 쉽게 부서진다고?",
				"뭔가 이상하다고 생각이 들었지만, 일단은 문이 열렸으니 안으로 들어가 보자."
		};
	public String[] stage2DoorKnockLines2 = {
			"넘어진 방문을 밟으며 안으로 들어가려고 발을 내딛는 순간",
			"콰아아아아아아아아아앙!!!!",
			"콰광!! 쾅!!!",
			"쿠우우우우우우우웅...",
			"귀가 먹먹해질 정도의 폭음이 일어나며 온 집안이 불에 휩싸였다",
			"....\r\n",
			".........\r\n",
			"\'[결정적인 단서] : 화재\'를 획득하셨습니다",
			"======================[Stage2] CLEAR======================"
};
	public String Stage2Proviso1 = 
			"1. 신발장\r\n"
			+"2. 소파\r\n"
			+"3. 냉장고\r\n"
			+"4. 바닥에 내던져진 에코백\r\n"
			+"5. 현관문\r\n"
	;
	public String Stage2EcobagList = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 작은 봉투\r\n"
	;
	public String Stage2EcobagList2 = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 원격 조종 장난감\r\n"
			+"4. 작은 봉투\r\n"
	;
	public String Stage2DoorOption = 
			"1. 문을 열어본다\r\n"
			+"2. 문을 두드린다\r\n"
	;
	public String Stage2ProvisoComb = 
			"단서 : 에코백\r\n"
			+"단서 : 휴대폰\r\n"
			+"단서 : 원격 조종 장난감\r\n"
			+"단서 : 지갑\r\n"
	;

}
