package c230830;

public class Main {
	public static void main(String[] args) {
		//라이브러리 
		// 도서관 , 책 => 정보의 모음
		// 2층 인문관, 3층 전문서적
		// =>분류 (클래스)
		// 클래스  => 변수(데이터),메서드(기능)
		// 분류 => 책의 내용, 종류에 따라
		// 분류 => 데이터나 기능으로 처리.
		// 모듈 || 라이브러리의 차이
		// 모듈 => (장비/ 기계)(모듈)를 새롭게 추가한다.
		// 프로그래밍에서의 모듈? => 폴더, 패키지, 프로젝트 등 
		
		//라이브러리 =>Library
		// => 줄여서 lib(binary => bin)과 같이
		// 프레임워크 || 라이브러리 || 모듈 => 셋 다 기능의 집합체, 가져다 사용한다. 모듈은 좀 더 물리적인 개념
		// 프레임워크  Vs 	라이브러리
		// 프레임워크 => frame : 뼈대,틀 / work : 일하다
		// 틀에 맞춰서 일한다
		// 일한다 => 코드 작성 => 틀에 맞춘다 => 규칙이 정해져 있는 라이브러리.(프레임 워크쪽에서 정해진 규칙대로 써야함)
		
	}
}
