package Stage4;

public class Stage4Lines {
	public String[] stage4Start=
		{		"..........",
				"..................",
				"그래..",
				"\"나는.....\"",
				"그랬었지..",
				"\"나는 그날..\"",
				"나는 그날 분명....",
				"자살을 선택했었다.",
				"\"나는.....\"",
				"......"
		};
	public String[] stage4CatsDead =
		{
				"마루...",
				"내가 죽인거나 마찬가지야..",
				"돈 몇 푼 아끼겠다고 문어발식 콘센트를 연결한 덕에 화재가 났다",
				"사방에서 불이 올라오는데, 나갈 곳은 없고..",
				"평소에 자기가 안전하다고 생각했던 이불 안에 들어가서 떨고 있었겠지",
				"\"얼마나 아팠을까...얼마나 무서웠을까...\"",
				"\"미안해...미안해...마루야.....\"",
				"...\r\n"
		};
	public String[] stage4Fire =
		{
				"내 부주의로 인해서 화재가 났다.",
				"회사에서 연락을 받고 급히 집에 돌아와 보니,",
				"내가 본 건 온 사방이 불에 타 재가 된 집과,",
				"도저히 믿기지 않는 광경.",
				"\"마루야!!!!!!!마루야!!!...\"",
				"한참을 울다가 간신히 마루를 수습하고 나오는 길에,",
				"나랑 똑같이 연락을 받고 온 집주인과 마주쳤다.",
				"\"아이고!!! 내 집!!!! 아이고....\"",
				"전소된 집 안을 보고 통곡하던 집 주인은,",
				"갑자기 눈을 시퍼렇게 뜨고 나에게 달려들어 멱살을 잡았다.",
				"\"내 집!!!!! 평생을 모아서 산 내 집 어떡할거야!!!!!\"",
				"\"물어내!!! 물어내라고 이년아!!!!!!\"",
				"내 멱살을 잡고 흔들던 집주인은, 내가 아무런 반응조차 하지 않자 내 목을 조르기 시작했다.",
				"\"죽어!!! 죽어서라도 물어내!!!!!!\"",
				"\"아주머니!! 진정하세요!! 김 대원 뭐해! 빨리 말려!!\"",
				"저지하는 소방대원들에게 끌려가면서도 내게 물어내라며 고래고래 소리를 지르던 아주머니는,",
				"그 날 오후에 바로 다시 찾아와 고소장을 내밀었다.",
				"그곳에는 내가 평생 보지도 못한 금액이 손해배상금으로 적혀 있었다.",
				"...\r\n"
		};
	public String[] Stage4Identity = {
			"나는..",
			"내 이름은 한수연..",
			"그저 평범한.. 26세 소시민이다.",
			"이제 다 기었났지만...",
			"\"이게.. 내 자살의 이유가 되지는 않아...\""
	};
	public String Stage3EcobagList = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 작은 봉투\r\n"
	;
	public String Stage3EcobagList2 = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 작은 봉투\r\n"
			+"4. 원격 조종 장난감\r\n"
	;
	public String Stage3FirstChoice = 
			"1. 조사한다\r\n"
			+"2. 탈출한다\r\n"
	;
	public String Stage3ProvisoComb = 
			"단서 : 에코백\r\n"
			+"단서 : 휴대폰\r\n"
			+"단서 : 원격 조종 장난감\r\n"
			+"단서 : 지갑\r\n"
	;

	public String[] Stage3Option = {
			"1.  조사한다\r\n",
			"2. 탈출한다\r\n"
	};
	public String[] stage3Proviso1 = {
			"1.  화장실\r\n",
			"2. 싱크대\r\n",
			"3. 안방 문\r\n",
			"4. 불길\r\n",
			"5. 현관문\r\n"
			};
	public String stage3Proviso2 =
			"1.  전기 스토브\r\n"
			+"2. 전기 포트\r\n"
			+"3. 멀티탭\r\n"
			+"4. 이불\r\n"
			;
}

