package Stage3;

public class Stage3Lines {
	public String[] orgbase = 
		{	"=============================================================================",
			"==================================생각 정리====================================",
			"============================================================================="	
		};
	public String[] stage3Start=
		{		"삐이이이이....",
				"삐이이이이..........",
				"갑작스레 난 폭음으로 인한 이명이 조금씩 가시기 시작하자,",
				"반사적으로 감았던 눈을 조금씩 떠보았다.",
				"\"이....이게 뭐야.....?\"",
				"눈앞에는 불바다가 된 거실이 보였다",
				"\"부...불이야!!!!!! 콜록! 콜록! 불이야아아아!!!!!\"",
				"목구멍을 뚫고 올라오는 기침을 애써 억누르며 소리를 질러보았지만",
				"밖에서는 그 어떤 소리도..어떤 반응도 들려오지 않았다.",
				"\"1...119, 119에 전화해야 해!\"",
				"급하게 휴대폰을 집어들었지만",
				"아무리 눌러봐도 휴대폰은 화면조차 켜지지 않았다",
				"\"진짜 하필 이럴 때!\"",
				"아무래도 도움은 기대하기 힘들 것 같고",
				"\"일단... 지금 당장 내가 할 수 있는 걸 해야 해\"",
				"가장 급한 일은..",
				"아무리 생각해봐도 사방에서 타오르고 있는 불을 끄는 것이었다",
				"\"우리 집에는 소화기가 없는데..\"",
				"일반 가정집에 소화기를 기대하기는 힘들겠고..",
				"오래된 빌라라서 아파트처럼 외부에 소화전이 있지도 않았다.",
				"\"일단 불길을 잡아야 해!\"",
				"...\r\n"
		};
	public String[] stage3Find =
		{
				"잠시 밖으로 향하는 현관문에 눈이 갔지만,",
				"지금은 도망쳐서는 안 될 이유가 있다",
				"내가 도망쳐버리면.. 우리 마루는..",
				"그래... 지금은 도망칠 때가 아니다. 뭐라도 해봐야 한다",
				"흔들리려는 마음을 다잡고, 거실 안쪽으로 한발짝 내딛었다.",
				"...\r\n"
		};
	public String[] stage3MainroomChoice =
		{
				"\"일단...일단 안방으로 들어가볼까..?\"",
				"...\r\n"
		};
	public String[] stage3MainRoomLines =
		{
				"사방에 퍼져나가는 불길을 조심조심 피해가며 안방 문을 타고 넘어갔다.",
				"밖에서 본 것처럼 안방에는 전혀 불길의 영향이 닿고있지 않았다.",
				".........",
				"\"그래... 여기가 내 방이었지..\"",
				"늘 그래왔던 것처럼 전혀 의식하지 않고 침대에 살짝 앉자, 약간의 위화감이 들었다.",
				"\"우리 마루는 어디에 있지?\"",
				"고양이를 찾으려 방 안을 둘러보던 와중, 눈에 띄는 흔적을 발견했다",
				"\"이 새까만 자국들... 뭔가 탄 자국같은데..\"",
				"검게 탄 자국은 길게 늘어져, 안방에서부터 밖으로 이어져 있었다.",
				"\"안방에서 무언가가 불이 나서 밖으로 번진 모양이구나..\"",
				"잠시 딴 생각을 하던 와중, 퍼뜩 정신이 들었다.",
				"\"마루..그래... 우리 마루를 찾아야지.\"",
				"마루는 분명 안방 안에 있을 것이다. 좀 자세히 찾아보자.",
				"....\r\n"
		};
	public String[] stage3Org =
		{
				"\"머....머리가 너무 아파...\"",
				"양 손을 덜덜 떨면서 천천히 잿더미로 손을 가져갔다.",
				"이 잿더미의 정체가 무엇인지보다.. 지금 더 중요한게 있잖아...",
				"\"...하하하....그래.. 마루..마루를 찾아야지..\"",
				"\"나도 참... 마루를 찾는 것이 최우선인데 지금 뭐 하고 있는거람..\"",
				"떨리던 손은 어느새 온몸으로 번져, 이빨이 서로 부딛히며 딱딱 소리를 내었다.",
				"\"마루...마루를 찾자...\"",
				"...\r\n"
		};
	public String[] stage3identityLines =
		{
				"온 몸에 떨림이 멈추질 않는다",
				"\"마루....마루야.....\"",
				"필사적으로 부정하고 싶었지만..",
				"이불 속에 웅크리고 있는 그 형체는..",
				"\"마루... 우리 마루....\"",
				"흐느낌이 목울대를 넘어 자연스럽게 흘러나온다",
				"어느 샌가 흘러넘치기 시작한 눈물이 사정없이 양 볼을 타고 흐른다.",
				"머릿속이 차가워졌다가 뜨거워졌다를 반복하며, 온 세상이 빙글빙글 돌아가는 느낌이다.",
				"\"흐으으으윽...마루야...마루야!!!\"",
				"흐느끼며 잿더미에 손을 대자,",
				"사방에서 새빨간 불길이 일어나며 안방의 모든것이 불타기 시작했다",
				"불길이 온 세상을 뒤덮어버릴 만큼 거대하게 타오르고 있는 안방 한 가운데서",
				"나는 그저 마루를 껴안고 울고 있을 뿐이었다",
				"\'[결정적인 단서] : 고양이의 죽음\'을 획득하셨습니다",
				"[Stage 3] CLEAR",
				"...\r\n"
		};
	public String Stage3Proviso1 = 
			"1. 화장실\r\n"
			+"2. 현관문\r\n"
			+"3. 싱크대\r\n"
			+"4. 불길\r\n"
			+"5. 안방\r\n"
	;
	public String Stage3EcobagList = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 작은 봉투\r\n"
	;
	public String Stage3EcobagList2 = 
			"1. 지갑\r\n"
			+"2. 휴대폰\r\n"
			+"3. 작은 봉투\r\n"
			+"4. 원격 조종 장난감\r\n"
	;
	public String Stage3FirstChoice = 
			"1. 조사한다\r\n"
			+"2. 탈출한다\r\n"
	;
	public String Stage3ProvisoComb = 
			"단서 : 에코백\r\n"
			+"단서 : 휴대폰\r\n"
			+"단서 : 원격 조종 장난감\r\n"
			+"단서 : 지갑\r\n"
	;

	public String[] Stage3Option = {
			"1. 조사한다\r\n",
			"2. 탈출한다\r\n"
	};
	public String[] stage3Proviso1 = {
			"1. 화장실\r\n",
			"2. 싱크대\r\n",
			"3. 안방 문\r\n",
			"4. 불길\r\n",
			"5. 현관문\r\n"
			};
	public String stage3Proviso2 =
			"1. 전기 스토브\r\n"
			+"2. 전기 포트\r\n"
			+"3. 멀티탭\r\n"
			+"4. 이불\r\n"
			;
}

